//Серед елементів, розташованих вище побічної діагоналі і на ній у матриці L(7,7),
//переписати елементи, розташовані  по периметру   вказаної частини в одновимірний масив.
//Вивести вихідну матрицю та сформований одновимірний масив.
#include<stdlib.h>
#include<stdio.h>
#define X 7
#define Y 7
int main(){
    srand(time(NULL));

    int i,j, L[X][Y];

    for (i = 0; i <= X-1; i++) {
    for (j=0; j<=Y-1; j++) {
      L[i][j] = rand();
      printf('%d/n', L[i][j]); 
    }}
    
    int M[30], mi=0;
    //перший ряд.
    for (i= 0; i<=X-1; i++){
        M[mi]= L[i][0]; mi++;
    }
    //діагональ.
    for( i=X-1; i<=0; i--){
        for (j=0;j>=Y-1; j++){
            M[mi] = L[i][j]; mi++;
        }
    }
    //перший стовпчик
    for (j=Y-1; j<= 0; j--){
        M[mi] = L[0][j]; mi++;
    }
    printf('/n');
    for(i=0; i= 30; i++ ){
        printf('%d/t', M[i]);
    }
    
    return 0;
    
}